game-architecture.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-12 Mon 09:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfffe930">1. Elm&#xa0;&#xa0;&#xa0;<span class="tag"><span class="platform">platform</span></span></a>
<ul>
<li><a href="#org01c9838">1.1. Model</a>
<ul>
<li><a href="#org2cf8bd6">1.1.1. <span class="todo TODO">TODO</span> can we embed control characters in strings?</a></li>
</ul>
</li>
<li><a href="#org38960bb">1.2. View</a></li>
<li><a href="#org06cc639">1.3. Update/Control</a></li>
</ul>
</li>
<li><a href="#org5cca2b6">2. Browser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="platform">platform</span></span></a></li>
<li><a href="#orgdcde086">3. <span class="todo TODO">TODO</span> World&#xa0;&#xa0;&#xa0;<span class="tag"><span class="model">model</span></span></a>
<ul>
<li><a href="#orgcd7c7ac">3.1. Control Characters&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ASCII">ASCII</span></span></a></li>
<li><a href="#orgf191e21">3.2. Text&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ASCII">ASCII</span></span></a>
<ul>
<li><a href="#orgb6364a7">3.2.1. font&#xa0;&#xa0;&#xa0;<span class="tag"><span class="view">view</span></span></a></li>
<li><a href="#org63f484d">3.2.2. misc widgets/resources</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org976e26b">4. <span class="todo TODO">TODO</span> Point&#xa0;&#xa0;&#xa0;<span class="tag"><span class="model">model</span></span></a>
<ul>
<li><a href="#orgefd688d">4.1. multiplicity</a></li>
</ul>
</li>
<li><a href="#org91d4b2b">5. <span class="todo LATER">LATER</span> Registers&#xa0;&#xa0;&#xa0;<span class="tag"><span class="model">model</span></span></a></li>
<li><a href="#orgf899726">6. Syntactic movement&#xa0;&#xa0;&#xa0;<span class="tag"><span class="control">control</span></span></a>
<ul>
<li><a href="#orge2e6971">6.1. <span class="todo TODO">TODO</span> column&#xa0;&#xa0;&#xa0;<span class="tag"><span class="h">h</span>&#xa0;<span class="l">l</span></span></a>
<ul>
<li><a href="#org4c118ee">6.1.1. Cannot move across EoLs?</a></li>
</ul>
</li>
<li><a href="#org07e04a6">6.2. <span class="todo TODO">TODO</span> row&#xa0;&#xa0;&#xa0;<span class="tag"><span class="j">j</span>&#xa0;<span class="k">k</span></span></a>
<ul>
<li><a href="#org833c70c">6.2.1. The behaviour of moving between disparate rows?</a></li>
</ul>
</li>
<li><a href="#org8234347">6.3. <span class="todo TODO">TODO</span> line&#xa0;&#xa0;&#xa0;<span class="tag"><span class="caret">caret</span>&#xa0;<span class="dollar">dollar</span></span></a></li>
</ul>
</li>
<li><a href="#org6e01a30">7. Semantic movement&#xa0;&#xa0;&#xa0;<span class="tag"><span class="control">control</span></span></a>
<ul>
<li><a href="#org1bfb6e1">7.1. <span class="todo TODO">TODO</span> word&#xa0;&#xa0;&#xa0;<span class="tag"><span class="b">b</span>&#xa0;<span class="w">w</span>&#xa0;<span class="e">e</span></span></a></li>
<li><a href="#org45a502e">7.2. sentence?</a></li>
<li><a href="#orgdf224e7">7.3. brackets?</a></li>
<li><a href="#orga19cca2">7.4. headings?</a></li>
</ul>
</li>
<li><a href="#org78472f9">8. <span class="todo LATER">LATER</span> Search&#xa0;&#xa0;&#xa0;<span class="tag"><span class="control">control</span></span></a>
<ul>
<li><a href="#org141f02b">8.1. char                                                              :f:F:;:</a></li>
<li><a href="#org73092d2">8.2. string                                                            :/:?:n:N:</a></li>
<li><a href="#org4b10f57">8.3. incremental?</a></li>
</ul>
</li>
<li><a href="#org4e10de7">9. Port&#xa0;&#xa0;&#xa0;<span class="tag"><span class="view">view</span></span></a>
<ul>
<li><a href="#org47e7d3c">9.1. <span class="todo TODO">TODO</span> text element&#xa0;&#xa0;&#xa0;<span class="tag"><span class="html">html</span></span></a></li>
</ul>
</li>
<li><a href="#org5d49940">10. <span class="todo LATER">LATER</span> HUD&#xa0;&#xa0;&#xa0;<span class="tag"><span class="view">view</span></span></a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfffe930" class="outline-2">
<h2 id="orgfffe930"><span class="section-number-2">1</span> Elm&#xa0;&#xa0;&#xa0;<span class="tag"><span class="platform">platform</span></span></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org01c9838" class="outline-3">
<h3 id="org01c9838"><span class="section-number-3">1.1</span> Model</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2cf8bd6" class="outline-4">
<h4 id="org2cf8bd6"><span class="section-number-4">1.1.1</span> <span class="todo TODO">TODO</span> can we embed control characters in strings?</h4>
</div>
</div>
<div id="outline-container-org38960bb" class="outline-3">
<h3 id="org38960bb"><span class="section-number-3">1.2</span> View</h3>
</div>
<div id="outline-container-org06cc639" class="outline-3">
<h3 id="org06cc639"><span class="section-number-3">1.3</span> Update/Control</h3>
</div>
</div>
<div id="outline-container-org5cca2b6" class="outline-2">
<h2 id="org5cca2b6"><span class="section-number-2">2</span> Browser&#xa0;&#xa0;&#xa0;<span class="tag"><span class="platform">platform</span></span></h2>
</div>
<div id="outline-container-orgdcde086" class="outline-2">
<h2 id="orgdcde086"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> World&#xa0;&#xa0;&#xa0;<span class="tag"><span class="model">model</span></span></h2>
<div class="outline-text-2" id="text-3">
<p>
The field of movement and objects within is represented as an ordinary string named 'world'
</p>
<ul class="org-ul">
<li>Pros
<ul class="org-ul">
<li>implements/enforces the emulation of a text editor</li>
<li>simple views?</li>
</ul></li>
<li><p>
Cons
</p>
<ul class="org-ul">
<li>complex controls?</li>
</ul>
<p>
If the game is really, really about text, we'll have no real in-game 'objects', just bytes.
</p>
<ul class="org-ul">
<li>char datatype implements game functionality:
switch statements within functions that traverse world
constant lookup tables if data-directed programming is desired.</li>
</ul>
<p>
The defacto character encoding set, ASCII, already gives us a wide-range of symbols to use
</p></li>
</ul>
</div>
<div id="outline-container-orgcd7c7ac" class="outline-3">
<h3 id="orgcd7c7ac"><span class="section-number-3">3.1</span> Control Characters&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ASCII">ASCII</span></span></h3>
<div class="outline-text-3" id="text-3-1">
<p>
It might be interesting just to see how many we can write into a runtime string without breaking things horribly. Really puts Elm's motto to the test.
If things do break horribly but we really want them, it might be worth making a custom string interface to work around it.
If we're making a collectathon they could make excellent trophies/secrets.
</p>
<ul class="org-ul">
<li><a href="http://www.aivosto.com/articles/control-characters.html">http://www.aivosto.com/articles/control-characters.html</a>
"It's not uncommon to find control characters forbidden in data. Control characters can have unwanted or unknown side-effects.
The easiest way for programmers to deal with them is to shut their eyes or deny such characters altogether."</li>
<li><a href="https://en.wikipedia.org/wiki/Newline">https://en.wikipedia.org/wiki/Newline</a>
A typical file/input stream is organized using special characters to denote line breaks and the end of a file.
These have various names and representations amongst systems and languages, EOL, line feed, etc.
A text editor will break a file into lines for easy navigation and viewing, but the underlying file contains these explicit characters.
Having world be a list of strings instead of a single string may be a worthwhile EoL abstraction</li>
</ul>
</div>
</div>
<div id="outline-container-orgf191e21" class="outline-3">
<h3 id="orgf191e21"><span class="section-number-3">3.2</span> Text&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ASCII">ASCII</span></span></h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Letters</li>
<li>Numbers</li>
<li>Whitespace</li>
<li>Symbols
<ul class="org-ul">
<li>Conjunctions/Operators</li>
<li>Delimiters</li>
<li>Brackets</li>
<li>Punctuation</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgb6364a7" class="outline-4">
<h4 id="orgb6364a7"><span class="section-number-4">3.2.1</span> font&#xa0;&#xa0;&#xa0;<span class="tag"><span class="view">view</span></span></h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
needs distinguishable glyphs for control characters and whitespace
customizable glyphs could go a long way in building aesthetic
</p>
</div>
</div>
<div id="outline-container-org63f484d" class="outline-4">
<h4 id="org63f484d"><span class="section-number-4">3.2.2</span> misc widgets/resources</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
<a href="http://ascii.co.uk/table">http://ascii.co.uk/table</a>
<a href="http://ascii.co.uk/interactive">http://ascii.co.uk/interactive</a>
<a href="http://ascii.co.uk/art">http://ascii.co.uk/art</a>
<a href="http://ascii.co.uk/text">http://ascii.co.uk/text</a>
<a href="http://ascii.co.uk/urlencoding">http://ascii.co.uk/urlencoding</a>
<a href="https://en.wikipedia.org/wiki/ASCII">https://en.wikipedia.org/wiki/ASCII</a>
man ascii
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org976e26b" class="outline-2">
<h2 id="org976e26b"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Point&#xa0;&#xa0;&#xa0;<span class="tag"><span class="model">model</span></span></h2>
<div class="outline-text-2" id="text-4">
<p>
The position of the Hero/cursor. 
an integer mod length world?
target of movement controls
</p>
</div>
<div id="outline-container-orgefd688d" class="outline-3">
<h3 id="orgefd688d"><span class="section-number-3">4.1</span> multiplicity</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Some text editors have multiple cursor functionality
<ul class="org-ul">
<li>vim achieves similar functionality through different means, might be interesting to contrast them</li>
</ul></li>
<li>if we include 'enemies' or something that manipulates the world outside of the player it might we worth considering implementing it this way?
<ul class="org-ul">
<li>imagine the frustration of trying to write something as someone else is trying to delete it.</li>
<li>frustrating problem + interesting solution = fun game</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org91d4b2b" class="outline-2">
<h2 id="org91d4b2b"><span class="section-number-2">5</span> <span class="todo LATER">LATER</span> Registers&#xa0;&#xa0;&#xa0;<span class="tag"><span class="model">model</span></span></h2>
<div class="outline-text-2" id="text-5">
<p>
At some point we may want to implement the ability to collect symbols and strings into registers for later use.
As a gameplay mechanic this is essentially an inventory system.
If there is a bijective correspondence between our movement controls and some subset of ASCII, we can treat the code as data and use the same registers for macros and text.
Consumption of register data is an interesting game-play mechanic
</p>
</div>
</div>
<div id="outline-container-orgf899726" class="outline-2">
<h2 id="orgf899726"><span class="section-number-2">6</span> Syntactic movement&#xa0;&#xa0;&#xa0;<span class="tag"><span class="control">control</span></span></h2>
<div class="outline-text-2" id="text-6">
<p>
'Simple' movement functions whose action depends only minimally on the world local to the point.
</p>
<ul class="org-ul">
<li>In real text editors, their behaviour may be subtle and subject to preference.
In a game, we'll probably demand the most simple and predictable implementation that enables the gameplay we're interested in.</li>
</ul>
</div>
<div id="outline-container-orge2e6971" class="outline-3">
<h3 id="orge2e6971"><span class="section-number-3">6.1</span> <span class="todo TODO">TODO</span> column&#xa0;&#xa0;&#xa0;<span class="tag"><span class="h">h</span>&#xa0;<span class="l">l</span></span></h3>
<div class="outline-text-3" id="text-6-1">
<p>
Move left or right. Probably the simplest control to implement.
</p>
</div>
<div id="outline-container-org4c118ee" class="outline-4">
<h4 id="org4c118ee"><span class="section-number-4">6.1.1</span> Cannot move across EoLs?</h4>
</div>
</div>
<div id="outline-container-org07e04a6" class="outline-3">
<h3 id="org07e04a6"><span class="section-number-3">6.2</span> <span class="todo TODO">TODO</span> row&#xa0;&#xa0;&#xa0;<span class="tag"><span class="j">j</span>&#xa0;<span class="k">k</span></span></h3>
<div class="outline-text-3" id="text-6-2">
<p>
Move up and down rows/lines.
</p>
</div>
<div id="outline-container-org833c70c" class="outline-4">
<h4 id="org833c70c"><span class="section-number-4">6.2.1</span> The behaviour of moving between disparate rows?</h4>
</div>
</div>
<div id="outline-container-org8234347" class="outline-3">
<h3 id="org8234347"><span class="section-number-3">6.3</span> <span class="todo TODO">TODO</span> line&#xa0;&#xa0;&#xa0;<span class="tag"><span class="caret">caret</span>&#xa0;<span class="dollar">dollar</span></span></h3>
<div class="outline-text-3" id="text-6-3">
<p>
Move to begining and end of lines
</p>
</div>
</div>
</div>
<div id="outline-container-org6e01a30" class="outline-2">
<h2 id="org6e01a30"><span class="section-number-2">7</span> Semantic movement&#xa0;&#xa0;&#xa0;<span class="tag"><span class="control">control</span></span></h2>
<div class="outline-text-2" id="text-7">
<p>
Movement functions whose action depends on significant parsing of world local to the point.
Effectively traverses within and across hierarchies of meaning and textual structure.
In real textual environments, their behaviour depends hugely on context and personal preference.
e.g. unix shells contain variables like IFS or WORDCHARS which list characters used for whitespace or word separators.
In a game, we might promote this configurability to an element of gameplay,
</p>
</div>
<div id="outline-container-org1bfb6e1" class="outline-3">
<h3 id="org1bfb6e1"><span class="section-number-3">7.1</span> <span class="todo TODO">TODO</span> word&#xa0;&#xa0;&#xa0;<span class="tag"><span class="b">b</span>&#xa0;<span class="w">w</span>&#xa0;<span class="e">e</span></span></h3>
<div class="outline-text-3" id="text-7-1">
<p>
Generally moves between elementary textual elements, such as clusters of alphanumeric characters seperated by whitespace
</p>
</div>
</div>
<div id="outline-container-org45a502e" class="outline-3">
<h3 id="org45a502e"><span class="section-number-3">7.2</span> sentence?</h3>
</div>
<div id="outline-container-orgdf224e7" class="outline-3">
<h3 id="orgdf224e7"><span class="section-number-3">7.3</span> brackets?</h3>
</div>
<div id="outline-container-orga19cca2" class="outline-3">
<h3 id="orga19cca2"><span class="section-number-3">7.4</span> headings?</h3>
</div>
</div>
<div id="outline-container-org78472f9" class="outline-2">
<h2 id="org78472f9"><span class="section-number-2">8</span> <span class="todo LATER">LATER</span> Search&#xa0;&#xa0;&#xa0;<span class="tag"><span class="control">control</span></span></h2>
<div class="outline-text-2" id="text-8">
<p>
Functions that take a character or string as an argument and perform local/global searches
</p>
</div>
<div id="outline-container-org141f02b" class="outline-3">
<h3 id="org141f02b"><span class="section-number-3">8.1</span> char                                                              :f:F:;:</h3>
<div class="outline-text-3" id="text-8-1">
<p>
f and F search for a char, given as a postfix argument, incrementally forwards/backwards.
; repeats
</p>
</div>
</div>
<div id="outline-container-org73092d2" class="outline-3">
<h3 id="org73092d2"><span class="section-number-3">8.2</span> string                                                            :/:?:n:N:</h3>
</div>
<div id="outline-container-org4b10f57" class="outline-3">
<h3 id="org4b10f57"><span class="section-number-3">8.3</span> incremental?</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Seems like more of a personal quality-of-life feature than a different type of search
Probably not worth implementing as a separate search, but maybe worth thinking about
the specific mechanics of the default search.
</p>
</div>
</div>
</div>
<div id="outline-container-org4e10de7" class="outline-2">
<h2 id="org4e10de7"><span class="section-number-2">9</span> Port&#xa0;&#xa0;&#xa0;<span class="tag"><span class="view">view</span></span></h2>
<div class="outline-text-2" id="text-9">
<p>
The displayed image of the game world.
Analogous to the camera in a game with 2d/3d physics, but on a truly discrete domain.
A text buffer environment can still have very impressive and useful view manipulation:
</p>
<ul class="org-ul">
<li>viewports can potentially:
<ul class="org-ul">
<li>scroll left/right</li>
<li>zoom (may or may not be equivalent to font resizing)</li>
<li>fold(hide) regions of text</li>
<li>provide multiple layers of detail in peripheral panes (document structure/outlines)</li>
</ul></li>
</ul>
<p>
But for our prototype just displaying the string should be fine.
</p>
</div>
<div id="outline-container-org47e7d3c" class="outline-3">
<h3 id="org47e7d3c"><span class="section-number-3">9.1</span> <span class="todo TODO">TODO</span> text element&#xa0;&#xa0;&#xa0;<span class="tag"><span class="html">html</span></span></h3>
<div class="outline-text-3" id="text-9-1">
<p>
We need a space on the screen to draw the buffer.
</p>
</div>
</div>
</div>
<div id="outline-container-org5d49940" class="outline-2">
<h2 id="org5d49940"><span class="section-number-2">10</span> <span class="todo LATER">LATER</span> HUD&#xa0;&#xa0;&#xa0;<span class="tag"><span class="view">view</span></span></h2>
<div class="outline-text-2" id="text-10">
<p>
UI elements that are used for displaying information
e.g. game context, progress trackers, register contents
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-11-12 Mon 09:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
